
pbl_story = """
金大爷今年 60 岁，刚刚退休。平时身体一直不太好，有高血压和糖尿
病。金大爷经常和老伙伴们唠嗑说道：都是年轻的时候太拼事业，没有好好
照顾自己的身体，又抽烟又喝酒，才会有现在的一身病。如今的金大爷，十
分注重自身的保养，打太极、练八段锦，日子很惬意。
上周天气突然转凉，金大爷没能及时增添衣物也着凉了，咳嗽、咳痰，
偶尔还有胸闷。老伴让金大爷快点去医院看看，但是金大爷听说最近是新型
冠状病毒流行期，担心自己去医院再次被感染，怎么也不愿意去医院。老金
从家里翻出去年女儿买的“维生素 C 泡腾片”，原本说明书说每天服用一粒，
但他心想，保健品多吃点更能提高免疫力，所以干脆一次用三粒泡水喝。没
想到，连吃了三天，咳嗽不见好转，还越来越厉害，连晚上睡觉也睡不好，
人没有力气，两条小腿越来越胀，鞋子也变小了。老伴很着急，赶紧联系女
儿带金大爷去看病。
"""

pbl_triger_questions = [
"1. 什么是水肿？水肿产生的原因有哪些？如何进行水肿的鉴别诊断？",
"2. 咳嗽的问诊要点？",
"3. 患者自行过量服用保健品是否合适？应该如何加强宣教？",
"4. 为了明确诊断，还需要询问哪些病史？需要完善哪些辅助检查？"
]

